# CreateCustomControl

## Description
Creates a layout manager control in a VectorScript to be used in conjuction with GS_OverrideControl in an external dialog handler.

```pascal
PROCEDURE CreateCustomControl(
				dialogID       : LONGINT;
				componentID    : LONGINT;
				widthInPixels  : INTEGER;
				heightInPixels : INTEGER);
```

```python

def vs.CreateCustomControl(dialogID, componentID, widthInPixels, heightInPixels):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|widthInPixels|INTEGER||
|heightInPixels|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern